chanvenjoe/STM32-learning/Projects/942-1709--限流20A(44)--方案2/942-1709--限流20A(44)--方案2/SOURCE/MAIN.c
/*---------------------------------------------------------------------------------------------------------*/
/*                                                                                                         */
/* Copyright(c) 2017 Nuvoton Technology Corp. All rights reserved.                                         */
/*                                                                                                         */
/*---------------------------------------------------------------------------------------------------------*/
 //升级记录

////20170619 G/S修改成低电平有效  .A-DET PORT功能取消 
//20180327 修改为型号M92 1取消大电流增加PWM功能
//2 G/S引脚功能取消，改为由P11采样霍尔控制车速1-2.5V对应高速15-98或低速15-60%	  
//20180505 增加刹车脚STOP，P00=STOP;内部上拉；低电平时，停止输出；
//20180507	 P00 POWER功能删除
//20180508	 P00加上拉
//20181008  //IO改一下；
           //速度开关改为用AD读，且把进退也放在这里检测；
           //增加电压检测
            //GS改为用霍尔
//20181126 //1.三档PWM分别改为：低->40% 中->70% 高->97%;
              //2.缓启动时间降低30%。
//20181210   	 DelayOffTM=20;改成 DelayOffTM=2; PWM关了，延时拉低FC&BC输出低电平的时间 0.4S， 改成50MS
//20181218   增加电流 18 20 25分别不同时间保护
        //   1 18A，2分钟，
       //    2 20A，5秒钟
       //    3 25A，2秒钟	
//20181219   M92客户 把慢启动时间加快至1.8秒
//20181224 1.去掉P01的电源控制功能，改为控制LED;去掉P10脚功能；使用常闭式电源开关，不再管理电源通断；
         //   2.P01为LED控制脚，可指示电源和故障； 
          //  1高电平有效；
          //  2开机电源灯常亮；
         // 3过流，灯快闪（亮0.1秒，灭0.1秒，保护动作后，循环）；
         //  4欠压，灯闪（亮1秒，灭1秒，保护动作后，循环）；
        //  5充电中，灯亮0.1秒，灭0.5秒，循环；
       // 6解除保护后，灯回复正常长亮；
        // 3.过流检测值加大，
        //   1 25A，2分钟，
       //    2 30A，5秒钟
       //    3 35A，2秒钟	 
 
 //20190105 要三个版本刹车 0秒   慢启动 1.2秒;
           //刹车 0秒   慢启动 1.5秒;
            //刹车 0秒   慢启动 1.8秒;

 //20190225 按文档“功能修改9B20 M92.doc”修改
 
	//20190704  去掉档位板上的霍尔调节----ok
	//20190710  将刹车PWM由2%改为3%----ok
  //20190717 去掉PWM_EN  同时将PWN改为PWM互补模式（P00为下桥输出  P05为上桥输出）-----ok
	//20190725  加入看门狗程序------------ok
	//20190731  将倒档和一档在6A保护，保护时间由2min改为30s  且二档和三档任保持2min保护-----ok
 //20190802  倒档电压是：0V--1V 改为：0V--0.5V ---------ok
 //          一档电压是：1V--2.5V 改为: 0.5V--2.5V--------ok
 //          将低电检测时间由： 2s改为：3s  -----ok     
  //20190807  更改每个档位占空比：倒档30% 一档30% 二档60% 三档100%-----------ok      //到这里是出货的版本  9fe7  600台
  //20190828   将死区时间由2us加大到6us-------ok

//20190829 //1.本版增加MOS管短路检测；
           //2.A_DET大电流检测--没有加检测延时
           //3.脚踏板检测加防接抖，需连续10ms电平不变，才认为是脚踏板有效；
//20190907  //过流保护、档位电流保护，档位板不连接保护时。将停止刹车占空比3%输出-----ok
//20190908  //脚踏后，将延时由10ms加至到50ms生效-----ok
//20190911  //加入测试模式------ok     //到这里是50块样板的出货版本
//20190921   //脚踏板踩下那刻，要判断继电器，接着50ms后，再次判断继电器，无吸合后，才开始mos检测，检测正常则才允许启动--ok         
//20190924     //脚踏板松开时，要加防抖   连续检测到50ms低电平，这时才认为脚踏松开---ok

//20200509   增加60A级别--过流--灯快闪     
//20210405   油门脚踏变霍尔
//20210416   慢启动时间改为2s
//20210426   增加限流25A功能
//20210508   将最小占空比由20%改至30%

//20210528   1.限流由25A；2.各档位PWM更改；3.欠压值更改；4.油门故障保护设置大于4V;5.油门启动电压值由1V--1.3V

//20210806    脚踏快速重启（将继电器判断还在mos管检测前）

//20210815    增加一二档堵转保护  23A   35A  ---1.5s保护

//20210902    慢启动改为3s   最大占空比95   
 
//20220117    1.堵转保护后 20s 关机
//            2.二档堵转时间由2s减少至1.5s
//            3.二档取消变速功能  和一档一样


#include "N76E003.h"
#include <string.h>
#include "Common.h"
#include "Delay.h"
#include "SFR_Macro.h"

#include "Function_define.h"
#include "TIME_ISP.h"
 
#define RELOAD_VALUE_H  (65536-8000)/256 //500US
#define RELOAD_VALUE_L  (65536-8000)%256//500US

  //---------------------------------------------------------
//funtion :Rx IR cortrol FANCAR
//body    :N76E003
//date    :2017 11 28
//in/output:
////20170619 G/S????????  .A-DET PORT????
//------------------------------------------

#define  STOP_TM      50//10MS*50=500	 刹车时间500MS ,单位10MS  50

#define  Vol_5V       245	//255 
#define  Vol_4_5V     244	//255    229=4.5

#define  Vol_3_5V   178//255*3.5/5            //档位板电压设置

#define  Vol_2_5V    128//255*2.5/5
#define  Vol_2V     102//255*2/5
#define  Vol_1V     26//255*1/5  51=1V   26=0.5V


#define  Vol_1_88V     96//255*1.88/5	19.2V时IO电压为1.88V

#define  Vol16V       134//         //欠压检测  低于27V
#define  Vol21_6V     161//     //32.7V  解除欠压   161

#define     nun_n      6


#define POWER_ON_TM	    100

#define  HALL_1000MV         66	//255*1/3.3=77     启动电压由1V改成1.3V

#define  HALL_4200MV         193//193   //255*2.5/3.3=193
#define  HALL_DV  	         (HALL_4200MV-HALL_1000MV) //116
//#define  HALL_DV  	        66
#define  PWM_15				 25//255*0.15   38

#define  HALL_4000MV         245	//255*1/3.3=77

#define   HALL_0500MV    26

#define  PWM_30				79//255*60
#define  PWM_30_DV           (PWM_30-PWM_15)//115

#define  PWM_40				104//255*60
#define  PWM_40_DV           (PWM_40-PWM_15)//115

#define  PWM_65				 168//255*60
#define  PWM_65_DV           (PWM_65-PWM_15)//115

#define  PWM_98				 243//255*98     255=100%     243=95%      248=97%
#define  PWM_98_DV           (PWM_98-PWM_15)//212  


#define  ELE10A         42//255*0.466v/5=  10A=33   19
#define  ELE12A         50    //12.5A--5s保护      44
#define  ELE15A 	    	55//255*0.757v/5        52

#define  ELE17_5A 	    61//255*0.886v/5         
#define  ELE21A 	      71//255*0.886v/5         
#define  ELE25A         82//255*1.255v/5        87
                                            
														
#define  ELE30A         78    //255*1.255v/5  98             27A---2min保护    28.5A--5S保护          99--20200507
#define  ELE32A         92                   //111
#define  ELE35A         100       //255*1.781v/5               113---20200507
	
#define  ELE60A        143//130//230   173---3.4V--60A     3.1V=55A=158    50A=2.81V=143


#define  ELE_1A         4
#define  ELE_2A         8//3A

//#define  PWM_15         40 //255*15/100

#define  PWM_55         140 //255*55/100
#define  PWM_80         204 //255*80/100


 #define  LED_IO		           P12
 #define  LED_SET              P12_PushPull_Mode     //故障指示灯--已改

 #define  LED1_IO		            P15
 #define  LED1_SET              P15_PushPull_Mode

#define  A_0_IO                  P05
#define  A_0_IO_SET              P05_Input_Mode     //电流检测口---ok
 
#define  STOP_IO                  P02	  /*充电脚*///    ---ok
#define  STOP_IO_SET             P02_Quasi_Mode	//P00_Input_Mode ---已改  P02_Quasi_Mode
  
	
#define  G_S_IO                  P17
#define  G_S_IO_SET              P17_Input_Mode 	
	
	
