chanvenjoe/STM32-learning/Projects/942-1709--限流20A(44)--方案2/942-1709--限流20A(44)--方案2/SOURCE/MAIN.c
				if(ceshi_zhengchang_FL==0)	  //正常模式
				{
					if(DanWei==0||DanWei==1)       //倒档和一档  2min保护  PWM_HallSet
					{
						if(++ELE30_BIG_TM>=240)//0.5s*240=120s   
						{
							ELE30_BIG_ERR_FL=1;  //
							ELE30_BIG_TM=0;
							ELE_Wait_5s=40;//WAIT 20S
						}
					}
				}
				if(DanWei==2)            //二档 2min保护
				{
					if(++ELE30_BIG_TM>=240)//0.5s*240=120s   240
					{
						ELE30_BIG_ERR_FL=1;//
						ELE30_BIG_TM=0;
						ELE_Wait_5s=40;//WAIT 20S
					}					
				}
							
				if(DanWei==3)    //   三档    1min
				{
					if(++ELE30_BIG_TM>=240)//0.5s*240=120s   
					{
						ELE30_BIG_ERR_FL=1;//
						ELE30_BIG_TM=0;
						ELE_Wait_5s=40;//WAIT 20S
					}					
				}
							
			}
			else
			{
				ELE30_BIG_TM=0;
				if(ELE_Wait_5s==0)
				ELE30_BIG_ERR_FL=0;					
			}

    //---------------------------5s保护-------（二级保护）-----------------------------------
			 
			if(ELE28_BIG_FL)
			{
				if(DanWei==0||DanWei==1) 
				{					
					if(++ELE28_BIG_TM>=90)//0.5s*90=45S
					{
						ELE28_BIG_ERR_FL=1;//
						ELE28_BIG_TM=0;
						ELE_Wait_5s=40;
					}
				}
					
				if(DanWei==2)
				{
					if(++ELE28_BIG_TM>=60)//0.5s*60=30S
					{
						ELE28_BIG_ERR_FL=1;//
						ELE28_BIG_TM=0;
						ELE_Wait_5s=40;
					}
				}
						
				if(DanWei==3)
				{
					if(++ELE28_BIG_TM>=40)//0.5s*120=20S
					{
						ELE28_BIG_ERR_FL=1;//
						ELE28_BIG_TM=0;
						ELE_Wait_5s=40;
					}
				}				
			}
			else
			{
				ELE28_BIG_TM=0;
				if(ELE_Wait_5s==0)
				ELE28_BIG_ERR_FL=0;					
			}

    //----------------------------2s保护-----------------------------------
			if(ELE50_BIG_FL)
			{
				if(DanWei==0||DanWei==1)
				{						
					if(++ELE20_BIG_TM>=20)//0.5s*20=10S
					{
						ELE20_BIG_ERR_FL=1;//
						ELE20_BIG_TM=0;
						ELE_Wait_5s=40;
					}
				}
				if(DanWei==2||DanWei==3)
				{
					if(++ELE20_BIG_TM>=10)//0.5s*10=5S
					{
						ELE20_BIG_ERR_FL=1;//
						ELE20_BIG_TM=0;
						ELE_Wait_5s=40;
					}	
				}
			}
			else
			{
				ELE20_BIG_TM=0;        
				if(ELE_Wait_5s==0)
				ELE20_BIG_ERR_FL=0;				 	
			}

    //---------------------------------------------
			if(ELE12_BIG_FL)                                   //一档堵转生效后  
			{                     
				if(++ELE12_BIG_TM>=5)// 5S/0.5*5=2.5s        // 堵转时间保护设置
				{
					duanlu_sw_fl=1;    //禁止电源开关关机
					ELE25_BIG_ERR_FL=1;//
					ELE12_BIG_TM=0;
					ELE_Wait_5s=60;//WAIT 30S
					duZ_close_fl=1;            //堵转后允许关机标志位
				}
			}
			else
			{
				ELE12_BIG_TM=0;
				if(ELE_Wait_5s==0)
				{
					ELE25_BIG_ERR_FL=0;   
					if(duZ_close_fl)
					POWER_IO=0;     //关机
				}									
			}		 			 
			if(ELE13_BIG_FL)                       //二档堵转生效后
			{                     
				if(++ELE13_BIG_TM>=4)// 5S/0.5*4=2s      // 堵转时间保护设置
				{
					duanlu_sw_fl=1;    //禁止电源开关关机
					ELE35_BIG_ERR_FL=1;//
					duZ_close_fl=1;            //堵转后允许关机标志位
					ELE13_BIG_TM=0;
					ELE_Wait_5s=60;//WAIT 30S
				}
			}
			else
			{
				ELE13_BIG_TM=0;
				if(ELE_Wait_5s==0)       //电流没有了，解除保护计时到了   才允许重启
				{
					ELE35_BIG_ERR_FL=0; 
					if(duZ_close_fl)
						POWER_IO=0;     //关机
				}
			} 
			/* if(ELE60_BIG_FL)               //60A过流保护生效标志     三档堵转
			 {
				 if(++ELE60_BIG_TM>=2)       //0.5*2=1
				 {
					ELE40_BIG_FL=1;  	 //灯快闪
				  ELE60_BIG_TM=0;
					ELE_Wait_5s=40;
				 }
			 }
				else
				{
					ELE60_BIG_TM=0;
					if(ELE_Wait_5s==0)               
					ELE40_BIG_FL=0;
				} */
					 
   	//-----------------------------------      //先以70%测试   40A=2.25V=80	
			if(xianliu_fl==0)		  //没有进入限流
			{		
				if((PWM>=175&&PWM<204)&&(DanWei==3)&&Cur_ResultNew>114)    // //70%--79%
				{
					if(++A_P_CT5>=nun_n)  //0.5s*6=3s 
					{
						ELEAP_BIG_ERR_FL5=1;
						A_P_CT5=0;
						ELE_Wait_5s=60;//WAIT 30S
						duanlu_sw_fl=1;    //禁止电源开关关机
						duZ_close_fl=1;      //堵转允许关机标志位
					}					
				}
			}
			else
			{
				A_P_CT5=0;
				if(ELE_Wait_5s==0)       //电流没有了，解除保护计时到了   才允许重启
				{
					ELEAP_BIG_ERR_FL5=0; 
					if(duZ_close_fl)
					POWER_IO=0;     //关机
				}			 
			}				 
						 
		//-----------------------------------      //先以60%测试   32A=1.8V=92	
						 
			if((PWM>=150&&PWM<175)&&(DanWei==3||DanWei==2)&&Cur_ResultNew>92)    // //60%--69%
			{
				if(++A_P_CT4>=nun_n)  //0.5s*2=1s 
				{
					ELEAP_BIG_ERR_FL4=1;
					A_P_CT4=0;
					ELE_Wait_5s=60;//WAIT 30S
					duanlu_sw_fl=1;    //禁止电源开关关机
					duZ_close_fl=1;      //堵转允许关机标志位
				}
					 					
			}
			else
			{
				A_P_CT4=0;
				if(ELE_Wait_5s==0)       //电流没有了，解除保护计时到了   才允许重启
				{
					ELEAP_BIG_ERR_FL4=0; 
					if(duZ_close_fl)
					POWER_IO=0;     //关机
				}			 
			}												 
			//-----------------------------------      //先以50%测试   28A=1.57v=80
         					
		//	A_P_ResultNew=((Cur_ResultNew/PWM_HallSet)*10);       //测各占空比50   		 
						 
			if((PWM>=125&&PWM<150)&&(DanWei==3||DanWei==2)&&Cur_ResultNew>80)     //50%--59%
			{
				if(++A_P_CT>=nun_n)  //0.5s*2=1s 
				{
					ELEAP_BIG_ERR_FL=1;
					A_P_CT=0;
					ELE_Wait_5s=60;//WAIT 30S
					duanlu_sw_fl=1;    //禁止电源开关关机
					duZ_close_fl=1;      //堵转允许关机标志位
				}
					 					
			}
			else
			{
				A_P_CT=0;
				if(ELE_Wait_5s==0)       //电流没有了，解除保护计时到了   才允许重启
				{
					ELEAP_BIG_ERR_FL=0; 
					if(duZ_close_fl)
					POWER_IO=0;     //关机
				}			 
			}

				 //-----------------------------------      //先以40%测试   25A=1.40V=57
         											 
			if((PWM>=102&&PWM<125)&&(DanWei==3||DanWei==2)&&Cur_ResultNew>72)    // //40%--49%
			{
				if(++A_P_CT1>=nun_n)  //0.5s*2=1s 
				{
					ELEAP_BIG_ERR_FL1=1;
					A_P_CT1=0;
					ELE_Wait_5s=60;//WAIT 30S
					duanlu_sw_fl=1;    //禁止电源开关关机
					duZ_close_fl=1;      //堵转允许关机标志位
				}

			}
			else
			{
				A_P_CT1=0;
				if(ELE_Wait_5s==0)       //电流没有了，解除保护计时到了   才允许重启
				{
					ELEAP_BIG_ERR_FL1=0; 
					if(duZ_close_fl)
					   POWER_IO=0;     //关机
				}			 
			}
				 
			//-----------------------------------      //先以30%测试   20A=1.125V=57
         											 
			if((PWM>=76&&PWM<102)&&(DanWei==3||DanWei==2)&&Cur_ResultNew>57)    // //30%--39%
			{
				if(++A_P_CT2>=nun_n)  //0.5s*2=1s 
				{
					ELEAP_BIG_ERR_FL2=1;
					A_P_CT2=0;
					ELE_Wait_5s=60;//WAIT 30S
					duanlu_sw_fl=1;    //禁止电源开关关机
					duZ_close_fl=1;      //堵转允许关机标志位
				}
			}
			else
			{
				A_P_CT2=0;
				if(ELE_Wait_5s==0)       //电流没有了，解除保护计时到了   才允许重启
				{
					ELEAP_BIG_ERR_FL2=0; 
					if(duZ_close_fl)
						POWER_IO=0;     //关机
				}			 
			}	 
				 	//-----------------------------------      //先20%测试   15A=0.84V=42										 
			if((PWM>=51&&PWM<76)&&(DanWei==3||DanWei==2)&&Cur_ResultNew>42)    // //20%--29%
			{
				if(++A_P_CT3>=nun_n)  //0.5s*2=1s 
				{
					ELEAP_BIG_ERR_FL3=1;
					A_P_CT3=0;
					ELE_Wait_5s=60;//WAIT 30S
					duanlu_sw_fl=1;    //禁止电源开关关机
					 duZ_close_fl=1;      //堵转允许关机标志位
				}				
			}
			else
			{
				A_P_CT3=0;
				if(ELE_Wait_5s==0)       //电流没有了，解除保护计时到了   才允许重启
				{
					ELEAP_BIG_ERR_FL3=0; 
					if(duZ_close_fl)
					POWER_IO=0;     //关机
				}			 
			}
		}

		if(ELE_Wait_5s)
			ELE_Wait_5s--;

