chanvenjoe/STM32-learning/Projects/942-1709--限流20A(44)--方案2/942-1709--限流20A(44)--方案2/SOURCE/MAIN.c
		if(VoltageLowWait)
			VoltageLowWait--;            //500ms自减一次
	}
			 
				
	if(G_S_FL)             //脚踏板
	{
		if(G_S_old_FL)
		{
			G_S_old_FL=0;
			G_S_L2H_FL=1;    
		}
		// POWER=1;
		G_S_FL_CT=0;

		HallLowCT=0;
		if(Stop_FL==0)
			POWER_ON_IO=1;
		else
			POWER_ON_IO=0;

	}
	else
	{
		G_S_old_FL=1;
		if(++HallLowCT>15000) //5*60*1000/20=15000   
		{
			POWER_ON_IO=0;                                                                
		}
	}
                                           
	if(Voltage_AD<Vol16V)
	{
		VoltageLowCT++;                //20ms自加一次 
		if(VoltageLowCT>225)     //    225=4.5s      在这里更改低电检测时间
		{            
			VoltageLowFL=1;
			turn_zero_fl=0;
			VoltageLowWait=40;
		}
	}
	else
	{
		VoltageLowCT=0;
		if((Voltage_AD>Vol21_6V)/*&&(G_S_FL==0)*/&&(VoltageLowWait==0))
			VoltageLowFL=0;
	}

	if(FRONT_CTRL==0)
	{
		if(FrontOFFTime<250)    //250
			FrontOFFTime++; //??????
	}
	else
		FrontOFFTime=0;

	if(BACK_CTRL==0)
	{
		if(BackOFFTime<250) 
			BackOFFTime++;//??????
	}
		 else
			BackOFFTime=0;
	/////////////////////////////////////////////////
	if(DelayOffTM>1)
	{
		DelayOffTM--;
		RELYDelayTM=2;/*刹车2*20MS后再关继电器*/  //2
	}
	else     //刹车间隔时间完后
	{

		if(RELYDelayTM)
			RELYDelayTM--;
		else			   
			RELY=0;
				
		if(DelayOffTM)
		{
			DelayOffTM=0;
			PWM=0;
			MoveCtrl();
			if(qudiao_shache_FL==0)			//各保护不起效，才能输出刹车占空比3%
			{				
				PWM=10;           //1%=2.55     //在这里更改刹车占空比   目前是3%
				MoveCtrl();
			}
			else     //各保护起效后，停止输出刹车占空比3%
			{
				PWM=0;
				MoveCtrl();
			}
			for(DelayOffTM=0;DelayOffTM<STOP_TM;DelayOffTM++)
			{
				if(G_S_FL&&G_S_L2H_FL)
				{ 
					G_S_L2H_FL=0;
					goto ESC_STOP2;
				}
			   
				count_500US_CT=0;
				while(count_500US_CT<=20)//10MS=20    
				{										  
					if(G_S_FL&&G_S_L2H_FL)
					{ 
						G_S_L2H_FL=0;
						goto ESC_STOP2;
					}
				}		
											
			}

			ESC_STOP2:                 
				DelayOffTM=0;     //先关继电器
				FRONT_CTRL=0;
				BACK_CTRL=0;
				count_500US_CT=0;
				while(count_500US_CT<=100)   //100*0.5=50ms  延时1  100
				{							
					if(G_S_FL&&G_S_L2H_FL)
					{ 
						G_S_L2H_FL=0;
						goto ESC_STOP8;
					}
				}

			ESC_STOP8:    
				PWM=0;         //再关PWM
				MoveCtrl();																
							
								 
			FRONT_CTRL=0;
			BACK_CTRL=0;		
			BeginMoveBackTM=0;
			BeginMoveFrontTM=0; 				 
			G_S_L2H_FL=0; 
			}
		}
	}
}
		 
 

void ADC_DSP(void)
{
	unsigned char ADtemp;
	//static 	  unsigned char ele_ct1	;
	ADCF=0;
	ADtemp=ADCRH;
	
	if(AD_CH==5)
	{
		AD_CH=7;
		Enable_ADC_AIN0;    //脚踏板霍尔油门  P17
		clr_ADCF;
		set_ADCS; 
		EADC=0;   


		Hall_Add+=ADtemp;            
		Hall_Add_ct++;
		if(Hall_Add_ct>=8)//>=255)	//??32?,???? 64     //平均了8次
		{

			Hall_Add_ct=0;
			Cur_ResultNew=Hall_Add>>3;//??    //除8    //Cur_ResultNew---电流值
			Hall_Add=0;				
 
	//==============================  
	    if(POWER_on_TM<POWER_ON_TM)
	  	   Cur_ResultNew=0;
  			
         if((Cur_ResultNew>=73)&&(DanWei==1))     //25A=73    73=1.41V      
              {
                    
                ELE12_BIG_ct++;
                ELE12_Small_ct=0;
                if(ELE12_BIG_ct>5)
                    ELE12_BIG_FL=1;                //一档堵转生效标志
              }
              else
                {
									ELE12_BIG_ct=0;
									ELE12_Small_ct++;           
									if(ELE12_Small_ct>5)
									ELE12_BIG_FL=0;
                }  
								
					if((Cur_ResultNew>=115)&&(DanWei==2))     //35A=100   1.96V     40A=115=2.25V
              {
                ELE13_BIG_ct++;
                ELE13_Small_ct=0;
                if(ELE13_BIG_ct>5)
                 ELE13_BIG_FL=1;            //二档堵转生效标志
              }
              else
                {								
									ELE13_Small_ct++;            
									if(ELE13_Small_ct>5)      //30
									{
										ELE13_BIG_FL=0;
										ELE13_BIG_ct=0;
									}
                } 		

    /*  if(Cur_ResultNew > ELE60A&&(DanWei==3))//ELE40A)       //60A过流保护    173=3.4V
			{		
			 ELE40_BIG_ct++;
			 ELE40_Small_ct=0;
			// if(ELE40_BIG_ct>5)                   //三档堵转生效标志
			// {
				 ELE60_BIG_FL=1;				
			// }
			 		 
			}
			else
			{		
				//  RELY=~ RELY;        //约500us自加一次   
				ELE40_BIG_ct=0;
				ELE40_Small_ct++;			
				if(ELE40_Small_ct>5)      //    3ms      
				 ELE60_BIG_FL=0;
			}*/

	//------------------------------------------------------	
  if(Cur_ResultNew > ELE60A&&DanWei==3)           //三档堵转保护
  {
		ELE40_BIG_FL=1;       //保护  灯快闪
    ELE40_BIG_ct++;
  	ELE40_Small_ct=0;
 //  if(ELE40_BIG_ct>15)//20=200MS  5=50MS    15--130ms
  // {
		  //ELE40_BIG_FL=1;
	  	ELE_Wait_5s=60;        //保护解除要60=30s   0.5s自减一次     120=1min
	// }
		 duZ_close_fl=1;      //堵转允许关机标志位
		duanlu_sw_fl=1;    //禁止电源开关关机
  }
  else
	{	
	  ELE40_BIG_ct=0;
		ELE40_Small_ct++;			
		if((ELE40_Small_ct>5)&&(ELE_Wait_5s==0))  
		{		
		   ELE40_BIG_FL=0;
			 if(duZ_close_fl)
				  POWER_IO=0;     //关机
		}			
			
	}

//----------------------------------------------------------
														
  if(Cur_ResultNew>ELE_BIG_SET2)
      {
            
				ELE50_BIG_ct++;
				ELE50_Small_ct=0;
				if(ELE50_BIG_ct>5)
				ELE50_BIG_FL=1;
      }
      else
        {            
          ELE50_BIG_ct=0;
            ELE50_Small_ct++;           
            if(ELE50_Small_ct>5)
                ELE50_BIG_FL=0;
        }
  
  if(Cur_ResultNew>ELE_BIG_SET1)
    {
          
      ELE30_BIG_ct++;
      ELE30_Small_ct=0;
    if(ELE30_BIG_ct>10)
          ELE30_BIG_FL=1;
    }
    else
      {
          
        ELE30_BIG_ct=0;
          ELE30_Small_ct++;           
          if(ELE30_Small_ct>5)
              ELE30_BIG_FL=0;
      }


	  if(Cur_ResultNew>ELE_BIG_SET3)
      {
            
        ELE28_BIG_ct++;
        ELE28_Small_ct=0;
      if(ELE28_BIG_ct>5)
            ELE28_BIG_FL=1;
      }
      else
        {
            
          ELE28_BIG_ct=0;
            ELE28_Small_ct++;           
            if(ELE28_Small_ct>5)
                ELE28_BIG_FL=0;
        }
   
  }
 }
  else
	 if(AD_CH==7)
	 {
	    AD_CH=4;
      Enable_ADC_AIN1;    //速度开关    P30
      clr_ADCF;
      set_ADCS; 
      EADC=0;
	// HallPWM=ADtemp;
		 
		 	//---------油门大于4.8V  停止工作，显示故障灯闪4下
		
