chanvenjoe/STM32-learning/Projects/942-1709--限流20A(44)--方案2/942-1709--限流20A(44)--方案2/SOURCE/MAIN.c
		if(ADtemp>HALL_4000MV) 
		{
		  NO_Connet_FL1=1;
		}
		 	 	 
	  if(ADtemp>HALL_1000MV)    //踩下脚踏  1.33v
	  {
		
		G_S_HighCT_fanjiao=0;
   //if(FRONT_CTRL==0&&BACK_CTRL==0)    //50ms生效后，判断继电器是否有吸合  没有才允许脚踏生效
	//	{
	    if(G_S_HighCT>=100) //10MS   0.5*20     100=50ms    200ms
		  {
		//	if(FRONT_CTRL==0&&BACK_CTRL==0)    //50ms生效后，判断继电器是否有吸合  没有才允许脚踏生效
		//		{
	        if(turn_zero_fl==1)/*&&(G_S_State==0))*/
            {
							if(G_S_State==0)	
               G_S_State=1;
								  						  
              if(G_S_State==2)
						   G_S_FL=1;         //脚踏板生效		
					  }	
				//}
		 //}
	    }
			ADtemp=ADtemp-HALL_1000MV;      //
			if(ADtemp>HALL_DV)
			ADtemp=HALL_DV;

			if((HIGH_LOWS_PEED_FL)&&(DanWei==3))    //高速档
			PWM_HallSet=ADtemp*PWM_98_DV/HALL_DV; 

		 if((HIGH_LOWS_PEED_FL==0)&&(DanWei==2))    //二档
			// PWM_HallSet=143;
			 PWM_HallSet=ADtemp*PWM_65_DV/HALL_DV; 

			if((HIGH_LOWS_PEED_FL==0)&&(DanWei==1))    //一档
				PWM_HallSet=80;
			//PWM_HallSet=ADtemp*PWM_40_DV/HALL_DV; 

			if((HIGH_LOWS_PEED_FL==0)&&(DanWei==0))    //倒档
			PWM_HallSet=ADtemp*PWM_40_DV/HALL_DV; 

			PWM_HallSet+=PWM_15;	
		 
	  }
	  else        //放开脚踏
	  {
	    if(ADtemp>HALL_0500MV)     //且大于0.5V  小于1.33V  
			{
          G_S_HighCT=0;	     
          NO_Connet_FL1=0;
			 if(G_S_HighCT_fanjiao>=100)    //50ms   连续50ms为低  才认为是松开脚踏
			 {
			    if((Stop_FL==0)&&(VoltageLowFL==0))
	         turn_zero_fl=1;
         
					 set_PWMRUN;       //PWM运行使能位开启
	        G_S_FL=0;
          G_S_State=0;
					PWM_xianzhi_fl=0;
					xianliu_fl=0;      //   限流进入条件解除
			
			 }						 
      }
			else       //小于0.5V  故障灯闪    
			{			
			    NO_Connet_FL1=1;			
			}
					
	  }
			
	 }
	 else
	  if(AD_CH==4)//速度和进退检测      
	 {
	    AD_CH=6;
      Enable_ADC_AIN7;     //电压检测   P11
      clr_ADCF;
      set_ADCS; 
      EADC=0;
           CurDanWei_AD=ADtemp;
            volHand_add+=ADtemp;            
           volHand_addct++;
           if(volHand_addct>=64)//>=255)  
           {           
           volHand_addct=0;
           DanWei_AD=volHand_add>>6;              //档位值
           volHand_add=0;  
            }
      
	  }
  	   else
	  if(AD_CH==6)//电压检测
	 {
	    AD_CH=5;
      Enable_ADC_AIN4;     //电流检测    P05        
      clr_ADCF;
      set_ADCS; 
      EADC=0;
      // Voltage_AD=ADtemp;

		   vol_add+=ADtemp;            
           vol_addct++;
           if(vol_addct==0)//>=64)//>=255)   //??32?,???? 64
           {
              
           vol_addct=0;
           Voltage_AD=vol_add>>8;//??
           vol_add=0;  
            }

	  }

}

void zidongguangji()
{
	if(FLAG_NMS)
	{
     FLAG_NMS=0;     //4ms自加一次
	
		if(duanlu_sw_fl==0)      //当堵转保护后，禁止手动关电源
		{
			if(SW_FL)
				{
						if(SW_IO)
					 {
						 SW_yanshi++;
						 if(SW_yanshi>=5)   //按键防抖20ms
						 {						 
						   if(SW_IO)
							 {
						    	POWER_IO=0;     //关机
								 SW_yanshi=5;
							 }
					   }		      
					 }					                  						 
				}
	  }
				
  	 if(SW_IO==0)
	   {  
			 
			  SW_yanshi=0;      //清按键计数
		       sw_timer++;
			 
		    if(sw_timer>=10)    //40ms     //上电40ms后才允许去关机
					{
						sw_timer=0;
						SW_FL=1;	
					}
  				
	   //----------------------------------				
		   if(G_S_IO==0)
		   {
				if(STOP_IO)        //不充电时进入待机计时    
				{
			    guanji_timer++;
	            
				 if(guanji_timer>=250)
				  {
					 guanji_timer=0;				
						guangji_1stimer++;
					   if(guangji_1stimer>=60)      //1min
					   {
							 guangji_1stimer=0;
							  guangji_1mintimer++;
							    if(guangji_1mintimer>=10)
									{
									 POWER_IO=0;   
									}		                
					   }
				 }
			  }
		   }
		   else
		   {			 
             guanji_timer=0;
			       guangji_1stimer=0;
				    guangji_1mintimer=0;
		   }
		}
}
}


//-----------------???-----------------------------
void main(void)
{ 
	init();
	while(1)
	{  	
		//--------看门狗设置------
		TA=0xAA;
		TA=0x55;
		WDCON = 0x7; 
		set_WDTR;
		set_WDCLR;
		set_EWDT;         //WDT看门狗使能位   

		PICON=0X80;			  //边沿触发和IO选择   P06
		PINEN=0X40;				 //使能--下降沿触发
		EIE=0X02;

		zidongguangji();   //自动关机程序
		//---------------------------		
		time_dsp();  
		MoveCtrl();
		if(ADCF)
		ADC_DSP();
	}
}


void init_ISR()  interrupt 7 
{
    if(PIF==0X40)   //P06 管脚中断标志位   生效位 
	{		 
				Delay3us();
			if(A_DET_IO==0)
			{
				ELE_InterruptDISP_TM = 20;    //20
				ELE_ERR_FL=1;   
				TurnHighSpeed_FL=0;
				TurnHighSpeed_FL_New=0;  			
				PWM5_P03_OUTPUT_DISABLE;
				PWM4_P01_OUTPUT_DISABLE;
				FLAG_IO_PWM=1;
				P03=1;//换为IO    //下桥
				P01=0;         //上桥
				turn_zero_fl=0;
				clr_PWMRUN;                      //PWM运行使能位关闭
				// A_DET_FL=0;
				PWM=0;     

				//	MoveCtrl();	 
				qudiao_shache_FL=1;   //各保护起效后，允许--停止刹车占空比输出

				PIF=0X00; 	       //清零
			}
			PIF=0X00; 	       //清零
	}
}





